Repository: kursitet/xblock-free-text-response
Catalog: freetextresponse/translations/*/LC_MESSAGES/text.po
Languages: ru

source: Display Correctness?
ru: Показывать индикатор корректности?

source: This is a flag that indicates if the indicator icon should be displayed after a student enters their response
ru: Показывать ли галочку-индикатор после приема ответа.

source: Display Name
ru: Отображаемое имя

source: This is the title for this question type
ru: Это название отображается в горизонтальной навигационной панели в верхней части страницы.

source: Full-Credit Key Phrases
ru: Ключевые слова для 100% оценки

source: This is a list of words or phrases, one of which must be present in order for the student's answer to receive full credit
ru: Список слов или фраз, как минимум одна из которых должна присутствовать чтобы слушатель получил максимальную оценку.

source: Half-Credit Key Phrases
ru: Ключевые слова для 50% оценки

source: This is a list of words or phrases, one of which must be present in order for the student's answer to receive half credit
ru: Список слов или фраз, как минимум одна из которых должна присутствовать чтобы слушатель получил 50% оценку.

source: Maximum Number of Attempts
ru: Максимальное число попыток

source: This is the maximum number of times a student is allowed to attempt the problem
ru: Максимальное число попыток которые слушатель сможет использовать.

source: Maximum Word Count
ru: Максимальное число слов

source: This is the maximum number of words allowed for this question
ru: Максимальное количество слов которые слушатель должен вписать для приема ответа.

source: Minimum Word Count
ru: Минимальное число слов

source: This is the minimum number of words required for this question
ru: Минимальное количество слов которые слушатель должен вписать для приема ответа.

source: Prompt
ru: Пояснения

source: This is the prompt students will see when asked to enter their response
ru: Слушатели увидят этот текст над окном ввода ответа

source: Submission Received Message
ru: Сообщение о приеме ответа

source: This is the message students will see upon submitting their response
ru: Слушатели увидят это сообщение когда отправят ответ набело.

source: Weight
ru: Вес задания

source: This assigns an integer value representing the weight of this problem
ru: Целое число, указывающее количество баллов за задание

source: Draft Received Message
ru: Сообщение о приеме черновика

source: This is the message students will see upon submitting a draft response
ru: Слушатели увидят это сообщение когда отправят черновик ответа.

source: Your response must be between {min} and {max} word.
ru: Ваш ответ должен содержать не менее {min} и не более {max} слов.

source: Invalid Word Count. {word_count_message}
ru: Неправильный объем ответа. {word_count_message}

source: {weight} point possible
ru: {weight} возможный балл

source: {score_string}/{weight} point
ru: {score_string}/{weight} балл

source: You have used {count_attempts} of {max_attempts} submission
ru: Вы использовали {count_attempts} из {max_attempts} попытки
